# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
 
# anchors
anchors:
  - [5,6, 8,14, 15,11]  #4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
 
# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 320*320*64
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4  160*160*128
   [-1, 3, C3, [128]], # 160*160*128
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8 # 80*80*256
   [-1, 6, C3, [256]], # 80*80*256
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16 # 40*40*512
   [-1, 9, C3, [512]], # 40*40*512
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32 # 20*20*1024
   [-1, 3, C3TSECAb20, [1024]], # 20*20*1024
   [-1, 1, SPPF, [1024, 5]],  # 9 # 20*20*1024
  ]
 
# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  ## 20*20*512
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 40*40*512
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4  40*40 *1024
   [-1, 3, C3, [512, False]],  # 13     40*40*512
 
   [-1, 1, Conv, [512, 1, 1]], #40*40*512
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #80*80*512
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3   80*80*768
   [-1, 3, C3, [512, False]],  # 17 (P3/8-small)  80*80*512
 
   [-1, 1, Conv, [256, 1, 1]], #18  80*80 *256
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #19  160*160*256
   [[-1, 2], 1, Concat, [1]], #20 cat backbone p2  160*160*384
   [-1, 3, C3, [256, False]], #21 160*160 *256
 
   [-1, 1, Conv, [256, 3, 2]],  #22   80*80 *256
   [[-1, 18], 1, Concat, [1]], #23 80*80 *512
   [-1, 3, C3, [256, False]], #24 80*80 *256
 
   [-1, 1, Conv, [256, 3, 2]], #25  40*40*256
   [[-1, 14], 1, Concat, [1]],  # 26  cat head P4  40*40*768
   [-1, 3, C3, [512, False]],  # 27 (P4/16-medium) 40*40*512
 
   [-1, 1, Conv, [512, 3, 2]],  #28  20*20*512
   [[-1, 10], 1, Concat, [1]],  #29 cat head P5  #20*20*1024
   [-1, 3, C3TSECAb20, [1024, False]],  # 30 (P5/32-large)  20*20 *1024
 
   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(p2, P3, P4, P5)
  ]
 
