# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2         # 64 X 320 X 320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4           # 128 X 160 X 160
   [-1, 1, nn.MaxPool2d, [2, 2, 0, 1]], # 2        # 128 x 80 x 80
   [1, 3, C3, [128]],   #3                        # 128 X 160 X 160
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8            # 256 X 80 X 80
   [-1, 1, nn.MaxPool2d, [2, 2, 0, 1]], #5        # 256 x 40 x 40
   [4, 6, C3, [256]],  #6                         # 256 X 80 X 80
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16           # 512 X 40 X 40
   [-1, 1, nn.MaxPool2d, [2, 2, 0, 1]], #8   # 512 x 20 x 20
   [7, 9, C3, [512]],   # 9                      # 512 X 40 X 40
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32         # 1024 X 20 X 20
   [-1, 3, C3, [1024]],      #11                   # 1024 X 20 X 20
   [-1, 1, SPPF, [1024, 5]],  # 12           
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #13 512 X 20 X 20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #14 512 X 40 X 40
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4 #15 1024 X 40 X 40
   [-1, 3, C3, [512, False]],  # 16 # 512 X 40 X 40

   [-1, 1, Conv, [256, 1, 1]], #17 256 X 40 X 40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #18 256 X 80 X 80
   [[-1, 2, 6], 1, Concat, [1]],  # cat backbone P3 #19 512 X 80 X 80
   [-1, 1, Conv, [512, 1, 1]], # 20
   [-1, 3, C3, [256, False]],  # 21 (P3/8-small) # 256 X 80 X 80

   [-1, 1, Conv, [256, 3, 2]], #22  256 X 40 X 40
   [[-1, 5, 17], 1, Concat, [1]],  #23   cat head P4 # 512 X 40 X 40
   [-1, 1, Conv, [512, 1, 1]], # 24
   [-1, 3, C3, [512, False]],  # 25  (P4/16-medium) # 512 X 40 X 40

   [-1, 1, Conv, [512, 3, 2]],  #26  512 X 20 X 20
   [[-1, 8, 13], 1, Concat, [1]],  #27  cat head P5  # 1024 X 20 X 20
   [-1, 1, Conv, [1024, 1, 1]], # 28
   [-1, 3, C3, [1024, False]],  #29 (P5/32-large) # 1024 X 20 X 20

   [[21, 25, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
